Tester/src/Catalogs/Sessions/Sessions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Sessions</name>
  <attributes>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </attributes>
  <attributes>
    <name>Localhost</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Port</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Proxy</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Version</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tester/src/Catalogs/Sessions/ObjectModule.bsl
Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkVersion () ) then
		Cancel = true;
	endif;
	if ( not checkLocalhost () ) then
		Cancel = true;
	endif;
	
EndProcedure

Function checkVersion ()
	
	if ( not Proxy
		or Version = "" ) then
		return true;
	endif;
	si = new SystemInfo ();
	platform = si.AppVersion;
	if ( StrLen ( Version ) = StrLen ( platform ) ) then
		return true;
	endif;
	Output.IncorrectVersion ( new Structure ( "Framework", framework ), "Version" );
	return false;
	
EndFunction

Function checkLocalhost ()
	
	if ( not Proxy ) then
		return true;
	endif;
	exp = Regexp.Create ();
	exp.Pattern = "\b(?:[0-9]{1,3}\.){3}[0-9]{1,3}\b";
	if ( exp.Test ( Localhost ) ) then
		return true;
	endif;
	Output.IncorrectIP ( , "IP", , "" );
	return false;

EndFunction
